Core/src/src/Catalogs/AzRyНастройкаРЛС/AzRyНастройкаРЛС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AzRyНастройкаРЛС</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоКонтрагентам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоСтруктурныеЕдиницам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченияПоБанковскимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктурныеЕдиницы</name>
    <attributes>
      <name>СтруктурныеЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>СчетБанка</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Catalogs/AzRyНастройкаРЛС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОграниченияПоОрганизациямПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоКонтрагентамПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоПодразделениямПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоСтруктурныеЕдиницамПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоБанковскимСчетамПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Пользователь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыОрганизаций

&НаКлиенте
Процедура ЗаполнитьОрганизации(Команда)

	Если ТаблицаЗаполнена() Тогда

		ТекстВопроса = НСтр(
			"ka='ცხრილი უკვე შევსებულია. გსურთ გადაწერა?';
			|ru='Таблица уже заполнена. Перезаписать?';
			|en='The table is already filled. Overwrite?'"
		);

		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОтветПользователя", ЭтотОбъект),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,
			,
			КодВозвратаДиалога.Нет
		);

	Иначе
		ЗаполнитьОрганизацииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветПользователя(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьОрганизацииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ТаблицаЗаполнена()
	Возврат Объект.Организации.Количество() > 0;
КонецФункции

&НаСервере
Процедура ЗаполнитьОрганизацииНаСервере()

	Объект.Организации.Очистить();

	Выборка = Справочники.Организации.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Организации.Добавить();
		НоваяСтрока.Организация = Выборка.Ссылка;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ВыборОрганизаций

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущаяСтрока  = Элементы.Организации.ТекущиеДанные;
	ТекущееЗначение = ?(ТекущаяСтрока <> Неопределено, ТекущаяСтрока.Организация, Неопределено);

	СписокДляВыбора = ПолучитьДоступныеОрганизации(ТекущееЗначение);

	Если СписокДляВыбора.Количество() = 0 Тогда

		ТекстСообщения = НСтр(
			"ka='ყველა ორგანიზაცია უკვე დამატებულია!';
			|ru='Все организации уже добавлены!';
			|en='All organizations are already added!'"
		);

		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;

	КонецЕсли;

	// Открываем список с флажками для множественного выбора
	СписокДляВыбора.ПоказатьОтметкуЭлементов(
		Новый ОписаниеОповещения("ОрганизацииВыбраны", ЭтотОбъект),
		"Выберите организации"
	);

КонецПроцедуры

																 
&НаКлиенте
Процедура ОрганизацииВыбраны(СписокВыбора, ДополнительныеПараметры) Экспорт

	Если СписокВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПерваяОтмеченная = Истина;

	Для Каждого Элемент Из СписокВыбора Цикл
		Если Элемент.Пометка Тогда

			Если ПерваяОтмеченная Тогда
				// Первый выбранный элемент — заполняем текущую строку
				ТекущаяСтрока = Элементы.Организации.ТекущиеДанные;
				Если ТекущаяСтрока <> Неопределено Тогда
					ТекущаяСтрока.Организация = Элемент.Значение;
				КонецЕсли;
				ПерваяОтмеченная = Ложь;
			Иначе
				// Остальные выбранные — добавляем новыми строками
				НоваяСтрока = Объект.Организации.Добавить();
				НоваяСтрока.Организация = Элемент.Значение;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеОрганизации(ТекущееЗначение)

	УжеДобавленные = Новый Массив;
	Для Каждого Строка Из Объект.Организации Цикл
		Если ЗначениеЗаполнено(Строка.Организация)
			И Строка.Организация <> ТекущееЗначение Тогда
			УжеДобавленные.Добавить(Строка.Организация);
		КонецЕсли;
	КонецЦикла;

	СписокВыбора = Новый СписокЗначений;
	Выборка = Справочники.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если УжеДобавленные.Найти(Выборка.Ссылка) = Неопределено Тогда
			СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокВыбора;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.ГруппаОрганизации.Видимость        = Объект.ОграниченияПоОрганизациям;
	Элементы.ГруппаКонтрагенты.Видимость        = Объект.ОграниченияПоКонтрагентам;
	Элементы.ГруппаПодразделения.Видимость      = Объект.ОграниченияПоПодразделениям;
	Элементы.ГруппаПроекты.Видимость            = Объект.ОграниченияПоПроектам;
	Элементы.ГруппаСтруктурныеЕдиницы.Видимость = Объект.ОграниченияПоСтруктурныеЕдиницам;
	Элементы.ГруппаБанковскиеСчета.Видимость    = Объект.ОграниченияПоБанковскимСчетам;

КонецПроцедуры

#КонецОбласти
